//------------------------------------------------------------------------------
// circle.cpp - содержит функции обработки круга
//------------------------------------------------------------------------------

#include "circle.h"

//------------------------------------------------------------------------------
// Ввод параметров круга из потока
void In(circle &t, ifstream &ifst) {
    ifst >> t.s.x >> t.s.y >> t.r;
}

// Случайный ввод параметров треугольника
void InRnd(circle &t) {
    InRnd(t.s);
    t.r = Random();
}

//------------------------------------------------------------------------------
// Вывод параметров круга в поток
void Out(circle &t, ofstream &ofst) {
    ofst << "It is Triangle: S = ("
         << t.s.x << ", " << t.s.y << "), R = "
         << t.r << ". "
         << "Perimeter = " << Perimeter(t) << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра круга
double Perimeter(circle &t) {
    return 2.0 * M_PI * t.r;
}
