//------------------------------------------------------------------------------
// rectangle_In.cpp - содержит процедуру ввода параметров 
// для уже созданного прямоугольника
//------------------------------------------------------------------------------

#include "rectangle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника из файла
void In(rectangle &r, ifstream &ifst) {
    ifst >> r.f.x >> r.f.y;
    ifst >> r.s.x >> r.s.y;
}

// Случайный ввод параметров прямоугольника
void InRnd(rectangle &r) {
    InRnd(r.f);
    InRnd(r.s);

    r.s.x += r.f.x;
    r.s.y += r.f.y;
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void Out(rectangle &r, ofstream &ofst) {
    ofst << "It is Rectangle: a = (" << r.f.x << ", " << r.f.y
         << "), b = (" << r.s.x << ", " << r.s.y << ")"
         << ". Perimeter = " << Perimeter(r) << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра прямоугольника
double Perimeter(rectangle &r) {
    return 2.0 * (r.s.x - r.f.x + r.s.y - r.f.y);
}
