//------------------------------------------------------------------------------
// triangle.cpp - содержит функции обработки треугольника
//------------------------------------------------------------------------------

#include "triangle.h"

//------------------------------------------------------------------------------
// Ввод параметров треугольника из потока
void In(triangle &t, ifstream &ifst) {
    ifst >> t.f.x >> t.f.y;
    ifst >> t.s.x >> t.s.y;
    ifst >> t.t.x >> t.t.y;
}

// Случайный ввод параметров треугольника
void InRnd(triangle &t) {
    InRnd(t.f);
    InRnd(t.s);
    t.t.x = Random() + t.f.x + t.s.x;
    t.t.y = Random() + t.f.y + t.s.y;
}

//------------------------------------------------------------------------------
// Вывод параметров треугольника в поток
void Out(triangle &t, ofstream &ofst) {
    ofst << "It is Triangle: a = ("
         << t.f.x << ", " << t.f.y << "), b = ("
         << t.s.x << ", " << t.s.x << "), c = ("
         << t.t.x << ", " << t.t.y << "). "
         << "Perimeter = " << Perimeter(t) << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра треугольника
double Perimeter(triangle &t) {
    return Distance(t.f, t.s) + Distance(t.f, t.t) + Distance(t.s, t.t);
}
